// Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]
// Знайти суму та кількість позитивних елементів.

const mainArray = [
  16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54,
  76, -4, 12, -35, 4, 47,
];

let sumPlus = 0;

mainArray.forEach()





let countPositive = 0;

array.forEach((num) => {
  if (num > 0) {
    sumPositive += num;
    countPositive++;
  }
});

console.log("Сума позитивних елементів:", sumPositive);
console.log("Кількість позитивних елементів:", countPositive);


const arr = [20, 40, 77, 53];

function count(arr) {
  let sum = 0;
  arr.forEach(function (item) {
    sum += item;
  });
  return sum;
}
count(arr);


// Знайти мінімальний елемент масиву та його порядковий номер.
// Знайти максимальний елемент масиву та його порядковий номер.
// Визначити кількість негативних елементів.
// Знайти кількість непарних позитивних елементів.
// Знайти кількість парних позитивних елементів.
// Знайти суму парних позитивних елементів.
// Знайти суму непарних позитивних елементів.
// Знайти добуток позитивних елементів.
// Знайти найбільший серед елементів масиву, ост альні обнулити.
